# Taps
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Better cat
brew 'coreutils' # Those that come with macOS are outdated
brew 'git' 
brew 'grep' 
brew 'mas' # Mac App Store manager
brew 'zsh' # 
brew 'zoxide' # Better cd
brew 'fzf' # Fuzzy search
brew 'eza' # Better ls
brew 'stow' # Symlink farm manager
brew 'forgot' # fzf based git ui
brew 'zsh-autosuggestions'
brew 'zsh-autocomplete'
brew 'zsh-syntax-highlighting'
brew 'lf' # Terminal file manager
brew 'tealdeer' # tldr in rust (easier man pages)
brew 'ripgrep' # Better grep

# Not sure I need this: don't install for now
# brew 'mackup' # mac backup thing

# Apps
cask 'alfred'
cask 'bettertouchtool'
cask 'discord'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'juliaup'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'visual-studio-code'
cask 'wezterm'

# Fonts
cask 'font-lato'
# Not sure which other fonts I actually use or need for powerlevel10k
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-hack-nerd-font'
cask 'font-meslo-lg-nerd-font'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Enpass', id: 732710998
