# Taps

# Binaries

## Update preinstalled stuff
brew 'grep' 
brew 'git' 

## New tools
brew 'bat' # Better cat
brew 'coreutils' # Those that come with macOS are outdated
brew 'mas' # Mac App Store manager
brew 'zsh' # 
brew 'zoxide' # Better cd
brew 'fzf' # Fuzzy search
brew 'eza' # Better ls
brew 'stow' # Symlink farm manager
brew 'forgit' # fzf based git ui
brew 'git-absorb' # automatically do fixups 
brew 'juliaup' # manage julia installations
brew 'perl'
brew 'sqlite' # Needed by telescope smart open (nvim)
brew 'tealdeer' # tldr in rust (easier man pages)
brew 'ripgrep' # Better grep
brew 'ncdu'
brew 'cheat' # Cheatsheets for terminal utilities
brew 'yazi' # terminal file manager
brew 'ffmpegthumbnailer' 
brew 'sevenzip' # archiver
brew 'jq' # deal with json files
brew 'poppler' # pdf 
brew 'fd' # better find
brew 'starship' # custom prompts
brew 'vivid' # something for colorschemes
brew 'node' # mason needs node to install pyright

## zsh plugins
brew 'zsh-autosuggestions'
brew 'zsh-autocomplete'
brew 'zsh-syntax-highlighting'

# Apps
cask 'alfred'
cask 'bettertouchtool'
cask 'discord'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'firefox'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'visual-studio-code'
cask 'wezterm'
cask 'alt-tab'

# Fonts
cask 'font-lato'
# Not sure which other fonts I actually use or need for powerlevel10k
cask 'font-symbols-only-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-hack-nerd-font'
cask 'font-meslo-lg-nerd-font'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Enpass', id: 732710998
